# Neo4j: Queries

## 1. Encontre todos os atores que dirigiram um filme em que também atuaram e apresente o nome do ator e o título do filme.

* **Command:**
    1. `MATCH (actor)-[:DIRECTED]->(m)<-[:ACTED_IN]-(actor) RETURN distinct actor.name, m.title`
    2. `MATCH (director)-[:DIRECTED]->(m)<-[:ACTED_IN]-(actor) WHERE director.name=actor.name RETURN distinct actor.name, m.title`

* **Result:**
    ```
    ╒════════════════╤═══════════════════╕
    │"actor.name"    │"m.title"          │
    ╞════════════════╪═══════════════════╡
    │"Tom Hanks"     │"That Thing You Do"│
    ├────────────────┼───────────────────┤
    │"Danny DeVito"  │"Hoffa"            │
    ├────────────────┼───────────────────┤
    │"Clint Eastwood"│"Unforgiven"       │
    └────────────────┴───────────────────┘
    ```

## 2. Para cada filme realizado depois de 2005, apresente os nomes de todos os atores que atuaram nesse filme.

* **Command:**
    `MATCH (a:Person)-[:ACTED_IN]->(m:Movie) WHERE m.released > 2005 RETURN collect(a.name), m.title`

* **Result:**
    ```
    ╒══════════════════════════════════════════════════════════════════════╤══════════════════════╕
    │"collect(a.name)"                                                     │"m.title"             │
    ╞══════════════════════════════════════════════════════════════════════╪══════════════════════╡
    │["Zach Grenier","Steve Zahn","Christian Bale","Marshall Bell"]        │"RescueDawn"          │
    ├──────────────────────────────────────────────────────────────────────┼──────────────────────┤
    │["Tom Hanks","Jim Broadbent","Halle Berry","Hugo Weaving"]            │"Cloud Atlas"         │
    ├──────────────────────────────────────────────────────────────────────┼──────────────────────┤
    │["Tom Hanks","Ian McKellen","Audrey Tautou","Paul Bettany"]           │"The Da Vinci Code"   │
    ├──────────────────────────────────────────────────────────────────────┼──────────────────────┤
    │["John Hurt","Stephen Rea","Natalie Portman","Hugo Weaving","Ben Miles│"V for Vendetta"      │
    │"]                                                                    │                      │
    ├──────────────────────────────────────────────────────────────────────┼──────────────────────┤
    │["Emile Hirsch","Rain","Christina Ricci","Ben Miles","Susan Sarandon",│"Speed Racer"         │
    │"John Goodman","Matthew Fox"]                                         │                      │
    ├──────────────────────────────────────────────────────────────────────┼──────────────────────┤
    │["Rain","Ben Miles","Rick Yune","Naomie Harris"]                      │"Ninja Assassin"      │
    ├──────────────────────────────────────────────────────────────────────┼──────────────────────┤
    │["Sam Rockwell","Michael Sheen","Frank Langella","Oliver Platt","Kevin│"Frost/Nixon"         │
    │ Bacon"]                                                              │                      │
    ├──────────────────────────────────────────────────────────────────────┼──────────────────────┤
    │["Julia Roberts","Tom Hanks","Philip Seymour Hoffman"]                │"Charlie Wilson's War"│
    └──────────────────────────────────────────────────────────────────────┴──────────────────────┘
    ```

## 3. Encontre pares de nós com mais do que uma relação entre si.

* **Command:**
    `MATCH (m)-[]->(n) WITH m, n, count(*) as total WHERE total > 1 return m, n, total`

* **Result:**
    ```
    ╒══════════════════════════════════════╤══════════════════════════════════════════════════════════════════════╤═══════╕
    │"m"                                   │"n"                                                                   │"total"│
    ╞══════════════════════════════════════╪══════════════════════════════════════════════════════════════════════╪═══════╡
    │{"name":"Aaron Sorkin","born":1961}   │{"title":"A Few Good Men","tagline":"In the heart of the nation's capi│2      │
    │                                      │tal, in a courthouse of the U.S. government, one man will stop at noth│       │
    │                                      │ing to keep his honor, and one will stop at nothing to find the truth.│       │
    │                                      │","released":1992}                                                    │       │
    ├──────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────┤
    │{"name":"Cameron Crowe","born":1957}  │{"title":"Jerry Maguire","tagline":"The rest of his life begins now.",│3      │
    │                                      │"released":2000}                                                      │       │
    ├──────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────┤
    │{"name":"Nora Ephron","born":1941}    │{"title":"When Harry Met Sally","tagline":"Can two friends sleep toget│2      │
    │                                      │her and still love each other in the morning?","released":1998}       │       │
    ├──────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────┤
    │{"name":"Rob Reiner","born":1947}     │{"title":"When Harry Met Sally","tagline":"Can two friends sleep toget│2      │
    │                                      │her and still love each other in the morning?","released":1998}       │       │
    ├──────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────┤
    │{"name":"Tom Hanks","born":1956}      │{"title":"That Thing You Do","tagline":"In every life there comes a ti│2      │
    │                                      │me when that thing you dream becomes that thing you do","released":199│       │
    │                                      │6}                                                                    │       │
    ├──────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────┤
    │{"name":"Clint Eastwood","born":1930} │{"title":"Unforgiven","tagline":"It's a hell of a thing, killing a man│2      │
    │                                      │","released":1992}                                                    │       │
    ├──────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────┤
    │{"name":"Lana Wachowski","born":1965} │{"title":"V for Vendetta","tagline":"Freedom! Forever!","released":200│2      │
    │                                      │6}                                                                    │       │
    ├──────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────┤
    │{"name":"Lilly Wachowski","born":1967}│{"title":"V for Vendetta","tagline":"Freedom! Forever!","released":200│2      │
    │                                      │6}                                                                    │       │
    ├──────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────┤
    │{"name":"Lana Wachowski","born":1965} │{"title":"Speed Racer","tagline":"Speed has no limits","released":2008│2      │
    │                                      │}                                                                     │       │
    ├──────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────┤
    │{"name":"Lilly Wachowski","born":1967}│{"title":"Speed Racer","tagline":"Speed has no limits","released":2008│2      │
    │                                      │}                                                                     │       │
    ├──────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────┤
    │{"name":"Danny DeVito","born":1944}   │{"title":"Hoffa","tagline":"He didn't want law. He wanted justice.","r│2      │
    │                                      │eleased":1992}                                                        │       │
    ├──────────────────────────────────────┼──────────────────────────────────────────────────────────────────────┼───────┤
    │{"name":"Nancy Meyers","born":1949}   │{"title":"Something's Gotta Give","released":2003}                    │3      │
    └──────────────────────────────────────┴──────────────────────────────────────────────────────────────────────┴───────┘
    ```

## 4. Encontre todos os pares de pessoas que fizeram revisões do mesmo filme. Apresente os seus nomes e título de cada filme.

* **Command:**
    `MATCH (a)-[:REVIEWED]->(m)<-[:REVIEWED]-(b) RETURN a.name as person1, b.name as person2, m.title as movie`

* **Result:**
    ```
    ╒══════════════════╤══════════════════╤═══════════════════╕
    │"person1"         │"person2"         │"movie"            │
    ╞══════════════════╪══════════════════╪═══════════════════╡
    │"Angela Scope"    │"James Thompson"  │"The Replacements" │
    ├──────────────────┼──────────────────┼───────────────────┤
    │"Jessica Thompson"│"James Thompson"  │"The Replacements" │
    ├──────────────────┼──────────────────┼───────────────────┤
    │"James Thompson"  │"Angela Scope"    │"The Replacements" │
    ├──────────────────┼──────────────────┼───────────────────┤
    │"Jessica Thompson"│"Angela Scope"    │"The Replacements" │
    ├──────────────────┼──────────────────┼───────────────────┤
    │"James Thompson"  │"Jessica Thompson"│"The Replacements" │
    ├──────────────────┼──────────────────┼───────────────────┤
    │"Angela Scope"    │"Jessica Thompson"│"The Replacements" │
    ├──────────────────┼──────────────────┼───────────────────┤
    │"James Thompson"  │"Jessica Thompson"│"The Da Vinci Code"│
    ├──────────────────┼──────────────────┼───────────────────┤
    │"Jessica Thompson"│"James Thompson"  │"The Da Vinci Code"│
    └──────────────────┴──────────────────┴───────────────────┘
    ```

## 5. Encontre todos os pares de atores que atuaram em vários filmes juntos.

* **Command:**
    `MATCH (a)-[:ACTED_IN]->(m)<-[:ACTED_IN]-(b) WITH a, b, count(*) as total WHERE a.name <> b.name AND total > 1 RETURN a.name as person1, b.name as person2`

* **Result:**
    ```
    ╒════════════════════╤════════════════════╕
    │"person1"           │"person2"           │
    ╞════════════════════╪════════════════════╡
    │"Laurence Fishburne"│"Hugo Weaving"      │
    ├────────────────────┼────────────────────┤
    │"Carrie-Anne Moss"  │"Hugo Weaving"      │
    ├────────────────────┼────────────────────┤
    │"Keanu Reeves"      │"Hugo Weaving"      │
    ├────────────────────┼────────────────────┤
    │"Hugo Weaving"      │"Laurence Fishburne"│
    ├────────────────────┼────────────────────┤
    │"Carrie-Anne Moss"  │"Laurence Fishburne"│
    ├────────────────────┼────────────────────┤
    │"Keanu Reeves"      │"Laurence Fishburne"│
    ├────────────────────┼────────────────────┤
    │"Hugo Weaving"      │"Carrie-Anne Moss"  │
    ├────────────────────┼────────────────────┤
    │"Laurence Fishburne"│"Carrie-Anne Moss"  │
    ├────────────────────┼────────────────────┤
    │"Keanu Reeves"      │"Carrie-Anne Moss"  │
    ├────────────────────┼────────────────────┤
    │"Hugo Weaving"      │"Keanu Reeves"      │
    ├────────────────────┼────────────────────┤
    │"Laurence Fishburne"│"Keanu Reeves"      │
    ├────────────────────┼────────────────────┤
    │"Carrie-Anne Moss"  │"Keanu Reeves"      │
    ├────────────────────┼────────────────────┤
    │"Jack Nicholson"    │"J.T. Walsh"        │
    ├────────────────────┼────────────────────┤
    │"Jack Nicholson"    │"Cuba Gooding Jr."  │
    ├────────────────────┼────────────────────┤
    │"Tom Cruise"        │"Cuba Gooding Jr."  │
    ├────────────────────┼────────────────────┤
    │"J.T. Walsh"        │"Jack Nicholson"    │
    ├────────────────────┼────────────────────┤
    │"Cuba Gooding Jr."  │"Jack Nicholson"    │
    ├────────────────────┼────────────────────┤
    │"Cuba Gooding Jr."  │"Tom Cruise"        │
    ├────────────────────┼────────────────────┤
    │"Meg Ryan"          │"Tom Hanks"         │
    ├────────────────────┼────────────────────┤
    │"Tom Hanks"         │"Meg Ryan"          │
    ├────────────────────┼────────────────────┤
    │"Rosie O'Donnell"   │"Tom Hanks"         │
    ├────────────────────┼────────────────────┤
    │"Tom Hanks"         │"Rosie O'Donnell"   │
    ├────────────────────┼────────────────────┤
    │"Ben Miles"         │"Rain"              │
    ├────────────────────┼────────────────────┤
    │"Rain"              │"Ben Miles"         │
    ├────────────────────┼────────────────────┤
    │"Gary Sinise"       │"Tom Hanks"         │
    ├────────────────────┼────────────────────┤
    │"Tom Hanks"         │"Gary Sinise"       │
    ├────────────────────┼────────────────────┤
    │"Jack Nicholson"    │"Danny DeVito"      │
    ├────────────────────┼────────────────────┤
    │"Danny DeVito"      │"Jack Nicholson"    │
    ├────────────────────┼────────────────────┤
    │"Bill Paxton"       │"Tom Hanks"         │
    ├────────────────────┼────────────────────┤
    │"Tom Hanks"         │"Bill Paxton"       │
    └────────────────────┴────────────────────┘
    ```

## 6. Determine a idade média do elenco do filme "Apollo 13" no ano do lançamento do filme.

* **Command:**
    `MATCH (a)-[:ACTED_IN]->(m) where m.title="Apollo 13" return avg(m.released-a.born) as avg_age`

* **Result:**
    ```
    ╒═════════╕
    │"avg_age"│
    ╞═════════╡
    │40.2     │
    └─────────┘
    ```


## 7. Encontre os 10 filmes com o elenco mais velho no momento do lançamento do filme. Apresente o filme e a idade média arredondada a 2 casas decimais, por ordem decrescente.


* **Command:**
    `MATCH (a)-[:ACTED_IN]->(m) RETURN m,  round(avg(m.released-a.born)*100)/100 AS avg_age order by avg_age desc limit 10`

* **Result:**
    ```
    ╒══════════════════════════════════════════════════════════════════════╤═════════╕
    │"m"                                                                   │"avg_age"│
    ╞══════════════════════════════════════════════════════════════════════╪═════════╡
    │{"title":"Unforgiven","tagline":"It's a hell of a thing, killing a man│62.0     │
    │","released":1992}                                                    │         │
    ├──────────────────────────────────────────────────────────────────────┼─────────┤
    │{"title":"Cloud Atlas","tagline":"Everything is connected","released":│54.25    │
    │2012}                                                                 │         │
    ├──────────────────────────────────────────────────────────────────────┼─────────┤
    │{"title":"Something's Gotta Give","released":2003}                    │54.0     │
    ├──────────────────────────────────────────────────────────────────────┼─────────┤
    │{"title":"The Birdcage","tagline":"Come as you are","released":1996}  │50.33    │
    ├──────────────────────────────────────────────────────────────────────┼─────────┤
    │{"title":"Frost/Nixon","tagline":"400 million people were waiting for │49.4     │
    │the truth.","released":2008}                                          │         │
    ├──────────────────────────────────────────────────────────────────────┼─────────┤
    │{"title":"What Dreams May Come","tagline":"After life there is more. T│48.0     │
    │he end is just the beginning.","released":1998}                       │         │
    ├──────────────────────────────────────────────────────────────────────┼─────────┤
    │{"title":"The Polar Express","tagline":"This Holiday Season… Believe",│48.0     │
    │"released":2004}                                                      │         │
    ├──────────────────────────────────────────────────────────────────────┼─────────┤
    │{"title":"V for Vendetta","tagline":"Freedom! Forever!","released":200│47.2     │
    │6}                                                                    │         │
    ├──────────────────────────────────────────────────────────────────────┼─────────┤
    │{"title":"RescueDawn","tagline":"Based on the extraordinary true story│46.75    │
    │ of one man's fight for freedom","released":2006}                     │         │
    ├──────────────────────────────────────────────────────────────────────┼─────────┤
    │{"title":"Snow Falling on Cedars","tagline":"First loves last. Forever│46.5     │
    │.","released":1999}                                                   │         │
    └──────────────────────────────────────────────────────────────────────┴─────────┘
    ```


## 9. Qual é o caminho mais curto (usando qualquer tipo de relação) entre John Cusack e Demi Moore?


* **Command:**
    `MATCH p=shortestPath((john:Person {name:"John Cusack"})-[*]-(demi:Person {name:"Demi Moore"})) RETURN p`

* **Result:**
    ```
    ╒══════════════════════════════════════════════════════════════════════╕
    │"p"                                                                   │
    ╞══════════════════════════════════════════════════════════════════════╡
    │[{"name":"John Cusack","born":1966},{"roles":["Denny Lachance"]},{"tit│
    │le":"Stand By Me","tagline":"For some, it's the last real taste of inn│
    │ocence, and the first real taste of life. But for everyone, it's the t│
    │ime that memories are made of.","released":1986},{"title":"Stand By Me│
    │","tagline":"For some, it's the last real taste of innocence, and the │
    │first real taste of life. But for everyone, it's the time that memorie│
    │s are made of.","released":1986},{},{"name":"Rob Reiner","born":1947},│
    │{"name":"Rob Reiner","born":1947},{},{"title":"A Few Good Men","taglin│
    │e":"In the heart of the nation's capital, in a courthouse of the U.S. │
    │government, one man will stop at nothing to keep his honor, and one wi│
    │ll stop at nothing to find the truth.","released":1992},{"title":"A Fe│
    │w Good Men","tagline":"In the heart of the nation's capital, in a cour│
    │thouse of the U.S. government, one man will stop at nothing to keep hi│
    │s honor, and one will stop at nothing to find the truth.","released":1│
    │992},{"roles":["Lt. Cdr. JoAnne Galloway"]},{"name":"Demi Moore","born│
    │":1962}]                                                              │
    └──────────────────────────────────────────────────────────────────────┘
    ```


## 10. Qual a dimensão do caminho mais curto (usando qualquer tipo de relação) entre Keanu Reeves e Tom Cruise?


* **Command:**
    `MATCH p=shortestPath((a:Person {name:"John Cusack"})-[*]-(b:Person {name:"Demi Moore"})) RETURN p`

* **Result:**
    ```
    ╒═══════════╕
    │"length(p)"│
    ╞═══════════╡
    │4          │
    └───────────┘
    ```


## 11. Qual a dimensão do caminho mais curto entre pessoas com nome Jim e pessoas com nome Kevin?


* **Command:**
    `MATCH p=shortestPath((a:Person)-[*]-(b:Person)) where a.name starts With "Jim" and b.name starts with "Kevin" RETURN a.name, b.name, length(p) limit 1`

* **Result:**
    ```
    ╒═══════════════╤══════════════╤═══════════╕
    │"a.name"       │"b.name"      │"length(p)"│
    ╞═══════════════╪══════════════╪═══════════╡
    │"Jim Cash"     │"Kevin Bacon" │4          │
    └───────────────┴──────────────┴───────────┘
    ```


## 12. Que pessoas têm uma distância de 2 para Jim Cash (a distância entre duas pessoas é o comprimento do caminho mais curto entre eles)?


* **Command:**
    `MATCH p=shortestPath((a:Person)-[*..2]-(b:Person {name:'Jim Cash'})) where a.name <> b.name and length(p) = 2 RETURN a.name`

* **Result:**
    ```
    ╒═════════════════╕
    │"a.name"         │
    ╞═════════════════╡
    │"Tom Cruise"     │
    ├─────────────────┤
    │"Kelly McGillis" │
    ├─────────────────┤
    │"Val Kilmer"     │
    ├─────────────────┤
    │"Anthony Edwards"│
    ├─────────────────┤
    │"Tom Skerritt"   │
    ├─────────────────┤
    │"Meg Ryan"       │
    ├─────────────────┤
    │"Tony Scott"     │
    └─────────────────┘
    ```


## 13. Qual é a maior distância de uma pessoa para Kevin Bacon?

* **Command:**
    `MATCH p=shortestPath((a:Person)-[*]-(b:Person {name:"Kevin Bacon"})) WHERE  a.name <> b.name RETURN length(p) ORDER BY length(p) DESC LIMIT 1`

* **Result:**
    ```
    ╒═══════════╕
    │"length(p)"│
    ╞═══════════╡
    │6          │
    └───────────┘
    ```


## 14. Qual é a maior distância entre duas pessoas?

* **Command:**
    `MATCH p=shortestPath((a:Person)-[*]-(b:Person)) WHERE  a.name <> b.name RETURN length(p) ORDER BY length(p) DESC LIMIT 1`

* **Result:**
    ```
    ╒═══════════╕
    │"length(p)"│
    ╞═══════════╡
    │10         │
    └───────────┘
    ```


## 15. Qual é a distribuição de distâncias em pares (isto é, para a distância 1, 2, 3, ... quantos pares de pessoas têm essa distância um do outro)?

* **Command:**
    `MATCH p=shortestPath((a:Person)-[*]-(c:Person)) WHERE a.name <> c.name RETURN length(p), count(*)`

* **Result:**
    ```
    ╒═══════════╤══════════╕
    │"length(p)"│"count(*)"│
    ╞═══════════╪══════════╡
    │2          │1276      │
    ├───────────┼──────────┤
    │4          │6248      │
    ├───────────┼──────────┤
    │6          │8026      │
    ├───────────┼──────────┤
    │8          │1610      │
    ├───────────┼──────────┤
    │3          │114       │
    ├───────────┼──────────┤
    │5          │246       │
    ├───────────┼──────────┤
    │7          │22        │
    ├───────────┼──────────┤
    │10         │8         │
    ├───────────┼──────────┤
    │1          │6         │
    └───────────┴──────────┘
    ```


## 16. Indique as 10 pessoas com menor distância média em que o caminho entre elas são relações do tipo ACTED_IN?

* **Command:**
    `MATCH p=shortestPath((a:Person )-[ACTED_IN*]-(c:Person)) WHERE a.name <> c.name RETURN a.name,avg(length(p)) ORDER BY avg(length(p)) LIMIT 10`

* **Result:**
    ```
    ╒══════════════════╤══════════════════╕
    │"a.name"          │"avg(length(p))"  │
    ╞══════════════════╪══════════════════╡
    │"Tom Hanks"       │3.5075757575757565│
    ├──────────────────┼──────────────────┤
    │"Jessica Thompson"│3.606060606060605 │
    ├──────────────────┼──────────────────┤
    │"Cuba Gooding Jr."│3.9393939393939372│
    ├──────────────────┼──────────────────┤
    │"Tom Cruise"      │3.9999999999999996│
    ├──────────────────┼──────────────────┤
    │"Lana Wachowski"  │4.0               │
    ├──────────────────┼──────────────────┤
    │"Lilly Wachowski" │4.0               │
    ├──────────────────┼──────────────────┤
    │"Kevin Bacon"     │4.053030303030302 │
    ├──────────────────┼──────────────────┤
    │"James Thompson"  │4.083333333333332 │
    ├──────────────────┼──────────────────┤
    │"Hugo Weaving"    │4.166666666666668 │
    ├──────────────────┼──────────────────┤
    │"Bonnie Hunt"     │4.212121212121213 │
    └──────────────────┴──────────────────┘
    ```