# Neo4j: Temática Livre - Driver (Python)

## Database Connection.
 
1. Install neo4j driver for python.
2. Follow the tutorial available in this [link](https://pypi.org/project/neo4j-driver/).

## Load CSV
```
create constraint on (c:Character) assert c.name is unique;
```

```
load csv with headers from "https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-all-edges.csv" as row
merge (src:Character {name: row.Source})
merge (tgt:Character {name: row.Target})
// global relationship
merge (src)-[r:INTERACTS]->(tgt) on create set r.weight = toInt(row.weight);
```

## Queries

### 1. Listar a informação de cada personagem.
* **Command:**
    ` match (c:Character) return c`

* **Result:**
    ```
    [Character]  name: Addam-Marbrand
    [Character]  name: Aegon-Frey-(son-of-Stevron)
    [Character]  name: Aegon-I-Targaryen
    [Character]  name: Aegon-Targaryen-(son-of-Rhaegar)
    [Character]  name: Aegon-V-Targaryen
    [Character]  name: Aemon-Targaryen-(Dragonknight)
    [Character]  name: Aemon-Targaryen-(Maester-Aemon)
    [Character]  name: Aenys-Frey
    [Character]  name: Aeron-Greyjoy
    [Character]  name: Aerys-I-Targaryen
    [Character]  name: Aerys-II-Targaryen
    [Character]  name: Aggar
    [Character]  name: Aggo
    [Character]  name: Alayaya
    [Character]  name: Albett
    [Character]  name: Alebelly
    [Character]  name: Alerie-Hightower
    [Character]  name: Alester-Florent
    [Character]  name: Alla-Tyrell
    [Character]  name: Allar-Deem
    [Character]  name: Allard-Seaworth
    (...)
    ```

### 2. Listar o nome de todas as personagens que tenham interagido com a Arya Stark.
* **Command:**
    ` match (c:Character {name: 'Arya-Stark'}) - [:INTERACTS] - (b:Character) return b.name , c.name`

* **Result:**
    ```
    Desmond interacts with Arya-Stark
    Bran-Stark interacts with Arya-Stark
    Vargo-Hoat interacts with Arya-Stark
    Sandor-Clegane interacts with Arya-Stark
    Brea interacts with Arya-Stark
    Woth interacts with Arya-Stark
    Talea interacts with Arya-Stark
    Thoros-of-Myr interacts with Arya-Stark
    Elmar-Frey interacts with Arya-Stark
    Jaime-Lannister interacts with Arya-Stark
    Robert-Baratheon interacts with Arya-Stark
    Jory-Cassel interacts with Arya-Stark
    (...)
    ```

### 3. Listar o número de interações de cada personagem.
* **Command:**
    ` match (c:Character) - [:INTERACTS] - (:Character) with c.name as name, count(*) as number_of_connections return name, number_of_connections`

* **Result:**
    ```
    [Number of connections] char name: Addam-Marbrand, number_of_connections: 12
    [Number of connections] char name: Aegon-Frey-(son-of-Stevron), number_of_connections: 4
    [Number of connections] char name: Aegon-I-Targaryen, number_of_connections: 9
    [Number of connections] char name: Aegon-Targaryen-(son-of-Rhaegar), number_of_connections: 15
    [Number of connections] char name: Aegon-V-Targaryen, number_of_connections: 1
    [Number of connections] char name: Aemon-Targaryen-(Dragonknight), number_of_connections: 1
    [Number of connections] char name: Aemon-Targaryen-(Maester-Aemon), number_of_connections: 26
    [Number of connections] char name: Aenys-Frey, number_of_connections: 4
    [Number of connections] char name: Aeron-Greyjoy, number_of_connections: 15
    [Number of connections] char name: Aerys-I-Targaryen, number_of_connections: 1
    [Number of connections] char name: Aerys-II-Targaryen, number_of_connections: 19
    [Number of connections] char name: Aggar, number_of_connections: 4
    [Number of connections] char name: Aggo, number_of_connections: 10
    [Number of connections] char name: Alayaya, number_of_connections: 4
    [Number of connections] char name: Albett, number_of_connections: 3
    [Number of connections] char name: Alebelly, number_of_connections: 4
    (...)
    ```

### 4. Listar o caminho mais curto entre Aemon Targaryen e Catelyn Stark e
* **Command:**
    ```
    MATCH (garth:Character {name:"Garth-Tyrell"}), (catelyn:Character {name:"Catelyn-Stark"})
    MATCH p=shortestPath((garth)-[:INTERACTS*]-(catelyn))
    RETURN p
    ```

* **Result:**
    ```
    Shortest Path between Garth-Tyrell and Catelyn Stark: ['Garth-Tyrell', 'Cersei-Lannister', 'Catelyn-Stark']
    ```

### 5. Listar as 10 personagens com mais conexões ordenardas por ordem de conexções (decrescente)
* **Command:**
    ` match (c:Character) - [:INTERACTS] - (:Character) with c.name as name, count(*) as number_of_connections return name, number_of_connections order by number_of_connections limit 10`

* **Result:**
    ```
    [Number of connections] char name: Tyrion-Lannister, number_of_connections: 122
    [Number of connections] char name: Jon-Snow, number_of_connections: 114
    [Number of connections] char name: Jaime-Lannister, number_of_connections: 101
    [Number of connections] char name: Cersei-Lannister, number_of_connections: 97
    [Number of connections] char name: Stannis-Baratheon, number_of_connections: 89
    [Number of connections] char name: Arya-Stark, number_of_connections: 84
    [Number of connections] char name: Catelyn-Stark, number_of_connections: 75
    [Number of connections] char name: Sansa-Stark, number_of_connections: 75
    [Number of connections] char name: Eddard-Stark, number_of_connections: 74
    [Number of connections] char name: Robb-Stark, number_of_connections: 74
    (...)
    ```

### 6. Listar as dimensões dos caminhos entre os vários Stark e os vários Martell.
* **Command:**
    ` match p=shortestPath((a:Character)-[*]-(b:Character)) where a.name ends With "Stark" and b.name ends with "Martell" return a.name as Stark, b.name as Martell, length(p) as length`

* **Result:**
    ```
    Length of path between [Stark] Arya-Stark and [Martell] Arianne-Martell: 2
    Length of path between [Stark] Arya-Stark and [Martell] Doran-Martell: 2
    Length of path between [Stark] Arya-Stark and [Martell] Elia-Martell: 2
    Length of path between [Stark] Arya-Stark and [Martell] Lewyn-Martell: 3
    Length of path between [Stark] Arya-Stark and [Martell] Manfrey-Martell: 4
    Length of path between [Stark] Arya-Stark and [Martell] Oberyn-Martell: 2
    Length of path between [Stark] Arya-Stark and [Martell] Quentyn-Martell: 3
    Length of path between [Stark] Arya-Stark and [Martell] Trystane-Martell: 2
    Length of path between [Stark] Benjen-Stark and [Martell] Arianne-Martell: 3
    Length of path between [Stark] Benjen-Stark and [Martell] Doran-Martell: 2
    Length of path between [Stark] Benjen-Stark and [Martell] Elia-Martell: 2
    Length of path between [Stark] Benjen-Stark and [Martell] Lewyn-Martell: 3
    Length of path between [Stark] Benjen-Stark and [Martell] Manfrey-Martell: 5
    Length of path between [Stark] Benjen-Stark and [Martell] Oberyn-Martell: 2
    Length of path between [Stark] Benjen-Stark and [Martell] Quentyn-Martell: 3
    Length of path between [Stark] Benjen-Stark and [Martell] Trystane-Martell: 3
    (...)
    ```

### 7. Mostrar o tamanho (número de personagens) da House Targaryen
* **Command:**
    ` match (a:Character) where a.name ends with "Targaryen" return length(collect(a.name)) as size_of_house_stark`

* **Result:**
    ```
    House Targaryen has 17 elements registered.
    ```

### 8. Listar as 10 personagens com maior score de PageRank
* **Command:**
    ```
    match (char:Character) with collect(char) as nodes
    call apoc.algo.pageRankWithConfig(nodes, {types:'INTERACTS'}) yeld node, score
    return node as character, score
    ```

* **Result:**
    ```
    Character: Tyrion-Lannister || Score: 9.47172
    Character: Stannis-Baratheon || Score: 6.20389
    Character: Tywin-Lannister || Score: 4.66443
    Character: Theon-Greyjoy || Score: 4.45384
    Character: Varys || Score: 3.58935
    Character: Sansa-Stark || Score: 3.58007
    Character: Wyman-Manderly || Score: 2.91887
    Character: Samwell-Tarly || Score: 2.7414
    Character: Robb-Stark || Score: 2.67279
    Character: Jon-Snow || Score: 2.64703
    ```

### 9. Apesentar a personagem com a maior distância (e mostrar também a distância) para Varys.
* **Command:**
    ` match p=shortestPath((a:Character)-[*]-(b:Character {name:"Varys"})) WHERE  a.name <> b.name RETURN a.name as name, length(p) as length ORDER BY length(p) DESC LIMIT 1`

* **Result:**
    ```
    Character: Gormon-Tyrell || Length: 6
    ```

### 10. Apesentar a maior distância entre 2 personagens e essas personagens.
* **Command:**
    ` match p=shortestPath((a:Character)-[*]-(b:Character)) where a.name <> b.name return a.name, b.name, length(p) ORDER BY length(p) DESC LIMIT 1`

* **Result:**
    ```
    (Character: Gerold-Grafton , Character: Gormon-Tyrell) | length: 9
    ```